[
	{
		"id": 1,
		"name": "Brussels sprouts, apple and pomegranate salad",
		"image_url": "https://smittenkitchendotcom.files.wordpress.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad.jpg?w=1500",
		"source": "https://smittenkitchen.com/2016/11/brussels-sprouts-apple-and-pomegranate-salad/",
		"cuisine": "Israeli",
		"type": ["Lunch", "Dinner"],
		"description": "Brussels sprouts, apple and pomegranate salad",
		"ingredients": ["1/2 large red onion, diced small", "2 tablespoons red wine vinegar",
			"2 teaspoons ground sumace", "1/4 teaspoon kosher salt, plus more to season salad",
			"2 cups shredded brussels sprouts",
			"1/2 cup fresh pomegranate seeds (from about 1/2 a large one)",
			"1/2 a large unpeeled apple, cored and diced (I used Granny Smith, the book recommends Pink Lady or Honeycrips)",
			"Juice of half a lemon, plus more to taste", "1 1/2 to 2 tablespoons honey, plus more to taste",
			"1/4 cup olive oil", "3/4 cup toasted, cooled walnuts, lightly crushed or coarsely chopped",
			"Ground chipotle chile pepper, urfa biber peppers, hot smoked paprika or another chile flake, to taste"
		],
		"instructions": ["Make the sumac-pickled onions: Combine red onion, wine vinegar,\nsumac and 1 / 4 teaspoon kosher salt in a small dish and set aside \nwhile you prepare \nthe other ingredients, or ideally at least 15 minutes.",
			"Combine all salad ingredients, including red onions and their pickling liquid, in a medium bowl and season to taste with salt and red pepper. Taste and adjust ingredients as desired. I’ ve seen versions of the recipe with more honey, olive oil and lemon;I didn’ t need them but you might find you do.",
			"This salad can be prepped ahead, but I’d keep the dressing off of it until at most an hour before serving so it doesn’ t discolor the sprouts."
		]
},
		{
			"id": 2,
			"name": "Spinach sheet pan quiche",
			"image_url": "https://smittenkitchendotcom.files.wordpress.com/2016/11/spinach-sheet-pan-quiche.jpg?w=1500",
			"source": "https://smittenkitchen.com/2016/11/spinach-sheet-pan-quiche/",
			"cuisine": "French",
			"type": ["Breakfast", "Lunch"],
			"description": "A spinach quiche.",
			"ingredients": ["1 2/3 cups (215 grams) all-purpose flour",
				"3/4 teaspoon kosher salt",
				"12 tablespoons (170 grams) cold unsalted butter, diced",
				"3 tablespoons (45 grams) very cold water",
				"Nonstick spray oil, for coating pan",
					"3/4 cup (176 grams, 6 ounces, or 3/4 of an 8-ounce brick) cream cheese, soft at room temperature",
					"2/3 cup (155 ml) half-and-half or 1/3 cup each whole milk and heavy cream",
					"6 large eggs",
					"2 10-ounce (283-gram) packages frozen chopped spinach, thawed",
					"1 cup (115 grams or 4 ounces) grated cheddar or gruyere",
					"1/2 cup (50 grams) finely grated Parmesan",
					"1 small bundle (2 to 3 ounces or about 8 thin green onions) thinly sliced",
					"1 teaspoon kosher salt",
					"1/2 teaspoon freshly ground black pepper"],
			"instructions": ["Make crust: In a food processor, blend flour and salt together. Add butter and pulse machine until butter is reduced to a fine meal, or couscous-sized bits. While running machine, drizzle in water; stop when dough has balled, a few seconds later. Wrap dough in plastic or waxed paper and set in freezer to quick - chill until firm but not rock - hard, about 15 to 20 minutes.You can also chill it in the fridge for 2 hours or up to 1 week until needed.",
		"Lightly coat a 9×13-inch (quarter-sheet) pan with oil. Line bottom with parchment paper.",
		"To roll out crust (trickier, but go for it if you’re up for the challenge): Flour your counter well. Remove crust from freezer or fridge, unwrap and flour the top of it. Even if it’s very hard, begin rolling it very gently, in light motions, so it doesn’t crack too much as you stretch it out, to about a 12×16-inch rectangle. Keep flouring top and counter underneath dough as it is prone to sticking. Work as quickly as possible because this dough softens even more than regular pie dough as it warms.",
		"Transfer dough to prepared pan. Lift overhang to let dough slack/droop into corners so you’re not stretching it a lot to shape it to the pan. Trim overhang to 1/2- to 1-inch, then fold overhang onto sides of dough, pressing all around and letting the dough extend slightly over the edge of the pan.",
		"To press in crust (less tricky, and what I always wish I’d done): Press dough in an even layer across bottom of pan; leave it thicker as it goes up the sides; pressing all around and letting the dough extend slightly over the edge of the pan.",
		"Both methods: Freeze shaped dough until solid, about 20 minutes. Save your scraps! You can use them to patch any holes or cracks formed when baking.",
		"Meanwhile, heat oven to 425 degrees F. Coat a large sheet of foil lightly with spray oil. Once crust is solid, prick it all over with a fork and press foil, oiled side down, tightly against dough. Fill foiled crust to the top with pie weights, dried beans or rice (that you don’t plan to eat at any time) or even pennies. Bake for 20 minutes then gently, carefully remove foil and weights and bake for 5 more minutes, unfilled.",
		"While crust par-bakes, make filling: Use an electric mixer or your best whisking skills to beat cream cheese in the bottom of a large bowl until smooth and fluffy. Gradually drizzle in half-and-half, whisking the whole time so that the mixture incorporates smoothly. Whisk in eggs, two at a time, until combined. Squeeze out spinach in handfuls, removing as much extra moisture as possible. Stir in spinach, cheddar, parmesan, scallions, salt and pepper.",
		"When crust has finished parbaking, leave oven on. Inspect crust for cracks or holes and use reserved dough to patch them if necessary. Pour in filling just to the top of the crust. You will probably have about 3/4 cup more filling than you can fit in the crust (not an issue if going crust-less or if you didn’t parbake the crust); you can bake this off in a separate oiled dish for an excellent breakfast on toast tomorrow.",
		"Bake quiche until crust is golden brown and filling is set, about 25 minutes. Cool at least 10 minutes before serving. Quiche keeps in fridge for 4 to 5 days."
	]
		},
		{
			"id": 3,
			"name": "Indian-spiced cauliflower soup",
			"image_url": "https://smittenkitchendotcom.files.wordpress.com/2016/09/indian-spiced-cauliflower-soup.jpg?w=1500",
			"source": "https://smittenkitchen.com/2016/09/indian-spiced-cauliflower-soup/",
			"cuisine": "Indian",
			"type": ["Lunch", "Dinner"],
			"description": "A cauliflower soup with Indian spices",
			"ingredients": ["2 tablespoons olive or peanut oil",
				"1/2 teaspoon whole cumin seeds",
				"1/4 teaspoon whole fennel seeds",
				"1 medium onion, peeled and chopped",
				"1 medium potato (about 6 ounces), peeled and chopped",
				"2 teaspoons peeled and chopped fresh ginger",
				"2 cloves garlic, peeled and chopped",
				"1 fresh hot green chili, chopped (more or less to taste)",
				"2 teaspoons ground coriander",
				"1 teaspoon ground cumin",
				"1/4 teaspoon ground turmeric",
				"1/4 teaspoon red chili powder or cayenne (to taste)",
				"About 3 1/2 cups cauliflower florets (from about 1/2 a large 2.75-pound head)",
				"2 medium tomatoes, peeled and chopped or 1 1/2 cups canned chopped tomatoes",
				"1 1/2 teaspoons salt, or to taste (we wanted more)",
				"A couple spoonfuls heavy cream or dollops of yogurt",
					"1/2 cup cooked basmati or other long-grain white rice",
					"Handful of fresh cilantro, chopped",
					"Freshly ground black pepper",
					"Lime wedges",
					"Toasted pita or naan wedges"],
			"instructions": ["Heat oil in the bottom of a 4 to 5-quart pot over medium-high heat. Once hot, add the cumin seeds and a few seconds later, the fennel seeds. Pause 2 seconds and then add the onions and potatoes. Stir and sauté for 5 minutes. Add the ginger, garlic and green chiles and stir for 1 minute more.",
				"Turn the heat to medium low and add the ground coriander, cumin, turmeric and red pepper. Stir for 1 minute. Add the cauliflower, tomatoes and salt and stir for 1 minute. Add 4 cups water, stir, and bring to a boil over medium-high heat. Cover, lower the heat again, and simmer gently for 25 minutes.",
				"Let the soup cool slightly, then blend it to your desired texture. Taste for seasoning and adjust as needed. Ladle into bowls and add a dollop of yogurt or tiny swirl (about 1/2 teaspoon) heavy cream, if desired. Squeeze lime juice over, add a few grinds of black pepper and place 2 tablespoons cooked rice to the center of each bowl. Scatter with cilantro and serve with pita wedges on the side, if desired. Dig in."]
		},
		{
			"id": 4,
			"name": "Korean-style mochi rice cake (Chapssaltteok)",
			"image_url": "http://www.maangchi.com/wp-content/uploads/2012/02/2-giftboxes1.jpg",
			"source": "http://www.maangchi.com/recipe/chapssalddeok",
			"cuisine": "Korean",
			"type": ["Dessert"],
			"description": "Korean-style mochi rice cake",
			"ingredients": ["Red beans", "Sugar", "Salt", "Rice syrup", "Vanilla extract",
				"Sweet rice flour", "Red food coloring", "Starch powder"
			],
			"instructions": ["Wash and drain 1 cup of dried red beans (azuki beans) and place them in a thick bottomed pot.",
			"Add 3 cups of water and bring to a boil over medium high heat for 10 minutes with the lid closed.",
			"Lower the heat and simmer for about 1½ hours. If the beans haven’t softened after 1½ hours, add more water and cook over low heat until they are soft and can be well mashed.",
			"Mash the beans with a wooden spoon (or food processor) until smooth.",
			"Put the beans back into the pot and add  ¾ cup brown sugar, ¼ ts salt, 1 ts vanilla extract, and 2-3 tbs rice or corn syrup.",
			"Stir with a wooden spoon over low heat until the sugar is dissolved and the paste looks a little shiny.",
			"Divide the paste into 2 even halves. Keep one half of the paste in the fridge or freezer for future use.",
			"Divide the remaining paste into 8 equal pieces and roll each piece into a ball. Set them aside.",
			"Place 1 cup of sweet rice flour (Mochiko powder), ¼ ts salt, 1 tbs sugar in a microwave-safe bowl.",
			"In a bowl add a drop of pink food coloring to ¾ cup water and mix well.",
			"Add the pink water to the rice flour mixture and mix it well with a spoon. Push the dough to the center of the bowl.",
			"Cover the dough with Saran wrap and cook on high for 3 minutes in the microwave.",
			"Remove the rice cake from the microwave and mix it with a wooden spoon for about 20 seconds.",
			"Cover it with the Saran wrap again and put it back in the microwave for another minute.",
			"Knead the hot rice cake with a wooden spoon vigorously in a circular motion about 100 times to make it chewy.",
			"Spread ¼ cup of starch powder on your cutting board and put the rice cake on it.",
			"Shape into a smooth 4×5 inch rectangle (10 cm x 12 cm) with wet hands and turn it over.",
			"Cut the rectangle into 8 even sized pieces with a wooden knife or spatula, and cover with Saran wrap to keep them from getting dried out.",
			"Take one piece of rice cake and flatten it into a round circle about 2½ inch (6.5 cm) in diameter.",
			"Add a sweet red bean ball to the middle of the piece of rice cake. Pull the rice cake over the ball and seal it by pinching the edges with your fingers. *tip: Use starch powder to keep the rice cake from sticking to your fingers.",
			"Repeat this until you’ve made 8 pieces of chapssaltteok."
		]
	}
]
